README.org
# -*- mode: org -*-
# -*- coding: utf-8 -*-
#+STARTUP: hidestars overview noindent inlineimages logdrawer shrink
#+OPTIONS:   H:1 num:t toc:t \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t date:nil
#+OPTIONS:   TeX:t LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS: author:nil email:nil creator:nil timestamp:nil
#+CATEGORY: softwarelibre, periodismodatos
#+TAGS: git, github, gitlab, bitbucket, repositorio
#+DESCRIPTION: Módulo de periodismo de datos de Git para trabajar con git y github.
#+latex_header: \renewcommand{\contentsname}{Prueba}
#+EXPORT_FILE_NAME: index.html
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup
#+AUTHOR: Adolfo Antón Bravo
#+EMAIL: adolflow@infotics.es
#+TITLE: Git, GitHub y Publicación Web
#+DATE: <2019-06-17 Mon>
#+language:  es

Módulo de periodismo de datos de /git/ donde aprenderemos cosas directamente relacionadas:

- git
- github
- gestión de proyectos
- crear copias de proyectos
- adaptar proyectos
- participar en proyectos.

Puedes trabajar con git desde herramientas gráficas o desde la línea de comandos.

En este caso vamos a trabajar con la línea de comandos, preferiblemente en GNU/Linux.

* Instalación de git
En GNU/Linux, tan solo hay que instalar =git-core=:
#+BEGIN_SRC sh
apt-get install git-core
#+END_SRC

En Mac se puede instalar el [[https://sourceforge.net/projects/git-osx-installer/][instalador gráfico de git]] y en Windows, [[https://git-for-windows.github.io/][git for Windows]].

#+BEGIN_QUOTE
Para usar git desde la terminal en Mac hay que activar las funciones de Xcode.
#+END_QUOTE

Si queremos disfrutar de una terminal potente, podríamos usar [[http://cygwin.com][Cygwin]] en Windows o la Terminal en  Mac.

Comprobamos que se ha instalado git con la opción =--version=

#+BEGIN_SRC sh
git --version
#+END_SRC

También tenemos los instaladores oficiales de [[http://www.git-scm.com][git]]:
- Mac, http://www.git-scm.com/download/mac
- Windows, http://www.git-scm.com/download/win

* GitHub
  
Crea una [[http://www.github.com][cuenta en GitHub]]

Si no te atreviste con el paso anterior, puedes usar estos programas de escritorio para Windows y Mac:

- Windows: http://windows.github.com y [[https://help.github.com/articles/set-up-git/#platform-windows][primeros pasos]]
- Mac OS X: http://mac.github.com y [[https://help.github.com/articles/set-up-git/#platform-mac][primeros pasos]]
** Wiki
En GitHub se puede añadir el wiki como un submódulo, tal como recuerdan [[https://stackoverflow.com/questions/6941688/how-to-integrate-a-github-wiki-into-the-main-project][aquí]]:

#+BEGIN_SRC bash
git submodule add git://github.com/you/proj.wiki
#+END_SRC

Que podríamos enlazar con nuestro directorio preferido:

#+BEGIN_SRC bash
git submodule add git://github.com/you/proj.wiki vocabulary
#+END_SRC

Ahí debería haber al menos dos archivos:
- =Home.md=, donde estaría la información de portada del wiki.
- =_Sidebar-vocabulary.md=, el menú de la derecha del wiki.
- =_Footer.md=, información al pie.

*** Qué son los submódulos
    :PROPERTIES:
    :url:      https://git-scm.com/book/en/v2/Git-Tools-Submodules
    :END:
Como su propio nombre indica, son parte de un repositorio git. A efectos prácticos, funcionan como un
subrepositorio, un repositorio dentro de un repositorio.

Para qué se pueden utilizar:
- Se pueden utilizar para separar código en submódulos.
- Pueden ser parte de más de un repositorio, por lo que pueden compartirse con otros proyectos/repositorios,
  de tal forma que cuando se actualice ese submódulo se actualizará en todos los repositorios donde está como
  submódulo.
**** Funcionamiento
     :PROPERTIES:
     :cite:     https://gist.github.com/gitaarik/8735255
     :END:
Cuando añades un submódulo a un repo, añades el código al repo y queda registrada la información que describe
a qué commit está apuntando el submódulo. El archivo =.gitmodules= almacena la versión del submódulo cuando es
añadido.
**** Añadir un submódulo
Se añade un submódulo de la siguiente manera:

#+begin_source Bash
git submodule add git@github.com:url_a/mi-submodulo.git ruta-donde-quiero-el-submodulo
#+end_source

De esta manera se pasa el código y se añade información al repositorio principal sobre el submódulo, lo que
contiene el commit a donde apunta el submódulo, que será el commit de la rama por defecto.
**** Obtener el código
Si se crea el submódulo, las otras personas tienen que inicializar el submódulo. Primero obtienes la
información con =git fech= o bien descargamos información y código con =git pull= y después se inicializan con =git submodule init=.

Si se clona un repositorio con submódulos, también se tiene que correr este comando para obtener el código del
submódulo ya que no lo hace automáticamente con =git clone=.
**** Actualizaciones del submódulo

Si actualizamos el submódulo, dado que es un repositorio separado, también tendremos que actualizar el repo
principal ya que su último commit apunta al anterior. Para actualizar, desde el repo principal, =git add=,
=git commit= y =git push=.
**** Mantener actualizados los submódulos

Si otras personas hicieron cambio en el submódulo, hay que actualizar el código con =git submodule update --remote=.
**** Truco

Si lanzamos =git submodule update --init=, inicializamos los submódulos.

En *caso* de /tener/ submódulos dentro de submódulos, añadimos =--recursive= al final de la sentencia.

Recuerda que se pueden hacer =alias= en =git=, por lo que podríamos crear uno tal que así:

#+begin_src
git config --global alias.update '!git pull && git submodule update --init --recursive'
#+END_SRC

De tal forma que con =git update= inicializaríamos correctamente el repositorio y el/los submódulo(s).

**** Gestión de submódulos
     :PROPERTIES:
     :cite:     https://github.com/exlinc/mdlr
     :END:
=mdlr= se declara como una herramienta de git para gestionar submódulos fácilmente.

