index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Git, GitHub y Publicación Web</title>
<meta name="generator" content="Org mode" />
<meta name="description" content="Módulo de periodismo de datos de Git para trabajar con git y github."
 />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Git, GitHub y Publicación Web</h1>
<div id="table-of-contents">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org840e016">1. Instalación de git</a></li>
<li><a href="#org86aae15">2. GitHub</a></li>
<li><a href="#org784db1d">3. Llave SSH</a></li>
<li><a href="#org4940570">4. Cambiar el editor por defecto</a></li>
<li><a href="#org67d3bca">5. Configuración</a></li>
<li><a href="#orgaa861c5">6. Crear un repositorio</a></li>
<li><a href="#orga860252">7. Clonar un repositorio</a></li>
<li><a href="#org470168d">8. Estado del repositorio</a></li>
<li><a href="#org1a0d579">9. Información de cambios en el repositorio</a></li>
<li><a href="#orgf320467">10. Añadir y modificar documentos</a></li>
<li><a href="#org30f665f">11. Renombrar archivos o directorios</a></li>
<li><a href="#org27aeaaa">12. Actualizar repositorio</a></li>
<li><a href="#org2b7dd1c">13. Deshacer cambios</a></li>
<li><a href="#org44859bc">14. Pull request</a></li>
<li><a href="#org9f01ce3">15. Borrar rama</a></li>
<li><a href="#orgd9ed393">16. Mantener un repositorio forkeado actualizado</a></li>
<li><a href="#org1a53552">17. Publicación web</a></li>
<li><a href="#orgac9b7f6">18. Gitignore</a></li>
<li><a href="#org9549190">19. Problemas</a></li>
<li><a href="#orga9bc21a">20. Pruebas</a></li>
<li><a href="#org57f0eb9">21. Bibliografía</a></li>
</ul>
</div>
</div>
<p>
Módulo de periodismo de datos de <i>git</i> donde aprenderemos cosas directamente relacionadas:
</p>

<ul class="org-ul">
<li>git</li>
<li>github</li>
<li>gestión de proyectos</li>
<li>crear copias de proyectos</li>
<li>adaptar proyectos</li>
<li>participar en proyectos.</li>
</ul>

<p>
Puedes trabajar con git desde herramientas gráficas o desde la línea de comandos.
</p>

<p>
En este caso vamos a trabajar con la línea de comandos, preferiblemente en GNU/Linux.
</p>

<div id="outline-container-org840e016" class="outline-2">
<h2 id="org840e016"><span class="section-number-2">1</span> Instalación de git</h2>
<div class="outline-text-2" id="text-1">
<p>
En GNU/Linux, tan solo hay que instalar <code>git-core</code>:
</p>
<div class="org-src-container">
<pre class="src src-sh">apt-get install git-core
</pre>
</div>

<p>
En Mac se puede instalar el <a href="https://sourceforge.net/projects/git-osx-installer/">instalador gráfico de git</a> y en Windows, <a href="https://git-for-windows.github.io/">git for Windows</a>.
</p>

<blockquote>
<p>
Para usar git desde la terminal en Mac hay que activar las funciones de Xcode.
</p>
</blockquote>

<p>
Si queremos disfrutar de una terminal potente, podríamos usar <a href="http://cygwin.com">Cygwin</a> en Windows o la Terminal en  Mac.
</p>

<p>
Comprobamos que se ha instalado git con la opción <code>--version</code>
</p>

<div class="org-src-container">
<pre class="src src-sh">git --version
</pre>
</div>

<p>
También tenemos los instaladores oficiales de <a href="http://www.git-scm.com">git</a>:
</p>
<ul class="org-ul">
<li>Mac, <a href="http://www.git-scm.com/download/mac">http://www.git-scm.com/download/mac</a></li>
<li>Windows, <a href="http://www.git-scm.com/download/win">http://www.git-scm.com/download/win</a></li>
</ul>
</div>
</div>

<div id="outline-container-org86aae15" class="outline-2">
<h2 id="org86aae15"><span class="section-number-2">2</span> GitHub</h2>
<div class="outline-text-2" id="text-2">
<p>
Crea una <a href="http://www.github.com">cuenta en GitHub</a>
</p>

<p>
Si no te atreviste con el paso anterior, puedes usar estos programas de escritorio para Windows y Mac:
</p>

<ul class="org-ul">
<li>Windows: <a href="http://windows.github.com">http://windows.github.com</a> y <a href="https://help.github.com/articles/set-up-git/#platform-windows">primeros pasos</a></li>
<li>Mac OS X: <a href="http://mac.github.com">http://mac.github.com</a> y <a href="https://help.github.com/articles/set-up-git/#platform-mac">primeros pasos</a></li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org1701617"></a>Wiki<br />
<div class="outline-text-3" id="text-2-1">
<p>
En GitHub se puede añadir el wiki como un submódulo, tal como recuerdan <a href="https://stackoverflow.com/questions/6941688/how-to-integrate-a-github-wiki-into-the-main-project">aquí</a>:
</p>

<div class="org-src-container">
<pre class="src src-bash">git submodule add git://github.com/you/proj.wiki
</pre>
</div>

<p>
Que podríamos enlazar con nuestro directorio preferido:
</p>

<div class="org-src-container">
<pre class="src src-bash">git submodule add git://github.com/you/proj.wiki vocabulary
</pre>
</div>

<p>
Ahí debería haber al menos dos archivos:
</p>
<ul class="org-ul">
<li><code>Home.md</code>, donde estaría la información de portada del wiki.</li>
<li><code>_Sidebar-vocabulary.md</code>, el menú de la derecha del wiki.</li>
<li><code>_Footer.md</code>, información al pie.</li>
</ul>
</div>

<ol class="org-ol">
<li><a id="org714590f"></a>Qué son los submódulos<br />
<div class="outline-text-4" id="text-2-1-1">
<p>
Como su propio nombre indica, son parte de un repositorio git. A efectos prácticos, funcionan como un
subrepositorio, un repositorio dentro de un repositorio.
</p>

<p>
Para qué se pueden utilizar:
</p>
<ul class="org-ul">
<li>Se pueden utilizar para separar código en submódulos.</li>
<li>Pueden ser parte de más de un repositorio, por lo que pueden compartirse con otros proyectos/repositorios,
de tal forma que cuando se actualice ese submódulo se actualizará en todos los repositorios donde está como
submódulo.</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="orgb81440b"></a>Funcionamiento<br />
<div class="outline-text-5" id="text-2-1-1-1">
<p>
Cuando añades un submódulo a un repo, añades el código al repo y queda registrada la información que describe
a qué commit está apuntando el submódulo. El archivo <code>.gitmodules</code> almacena la versión del submódulo cuando es
añadido.
</p>
</div>
</li>
<li><a id="org144bdb5"></a>Añadir un submódulo<br />
<div class="outline-text-5" id="text-2-1-1-2">
<p>
Se añade un submódulo de la siguiente manera:
</p>

<div class="source">
<p>
git submodule add git@github.com:url_a/mi-submodulo.git ruta-donde-quiero-el-submodulo
</p>

</div>

<p>
De esta manera se pasa el código y se añade información al repositorio principal sobre el submódulo, lo que
contiene el commit a donde apunta el submódulo, que será el commit de la rama por defecto.
</p>
</div>
</li>
<li><a id="org646d478"></a>Obtener el código<br />
<div class="outline-text-5" id="text-2-1-1-3">
<p>
Si se crea el submódulo, las otras personas tienen que inicializar el submódulo. Primero obtienes la
información con <code>git fech</code> o bien descargamos información y código con <code>git pull</code> y después se inicializan con <code>git submodule init</code>.
</p>

<p>
Si se clona un repositorio con submódulos, también se tiene que correr este comando para obtener el código del
submódulo ya que no lo hace automáticamente con <code>git clone</code>.
</p>
</div>
</li>
<li><a id="org078ac3b"></a>Actualizaciones del submódulo<br />
<div class="outline-text-5" id="text-2-1-1-4">
<p>
Si actualizamos el submódulo, dado que es un repositorio separado, también tendremos que actualizar el repo
principal ya que su último commit apunta al anterior. Para actualizar, desde el repo principal, <code>git add</code>,
<code>git commit</code> y <code>git push</code>.
</p>
</div>
</li>
<li><a id="org258b19b"></a>Mantener actualizados los submódulos<br />
<div class="outline-text-5" id="text-2-1-1-5">
<p>
Si otras personas hicieron cambio en el submódulo, hay que actualizar el código con <code>git submodule update --remote</code>.
</p>
</div>
</li>
<li><a id="org065cbd2"></a>Truco<br />
<div class="outline-text-5" id="text-2-1-1-6">
<p>
Si lanzamos <code>git submodule update --init</code>, inicializamos los submódulos.
</p>

<p>
En <b>caso</b> de <i>tener</i> submódulos dentro de submódulos, añadimos <code>--recursive</code> al final de la sentencia.
</p>

<p>
Recuerda que se pueden hacer <code>alias</code> en <code>git</code>, por lo que podríamos crear uno tal que así:
</p>

<pre class="example">
git config --global alias.update '!git pull &amp;&amp; git submodule update --init --recursive'
</pre>

<p>
De tal forma que con <code>git update</code> inicializaríamos correctamente el repositorio y el/los submódulo(s).
</p>
</div>
</li>

<li><a id="orga462a92"></a>Gestión de submódulos<br />
<div class="outline-text-5" id="text-2-1-1-7">
<p>
<code>mdlr</code> se declara como una herramienta de git para gestionar submódulos fácilmente.
</p>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
