index.html

<div id="outline-container-org784db1d" class="outline-2">
<h2 id="org784db1d"><span class="section-number-2">3</span> Llave SSH</h2>
<div class="outline-text-2" id="text-3">
<blockquote>
<p>
Si no sabes qué es SSH, sáltate esto
</p>
</blockquote>

<p>
Las claves SSH son una forma de identificar ordenadores de confianza sin comprometer contraseñas. Se peude generar unas claves SSH y añadir la clave pública de GitHub para que se produzca la conexión.
</p>

<p>
GitHub recomienda revisar regularmente la lista de claves SSH y revocar aquellas que no se usen, no se hayan usado o no se vayan a usar.
</p>

<p>
Puedes conectarte por ssh y activar la llave ssh para conectarte de forma autentificada automáticamente. Vayamos paso a paso.
</p>
</div>

<ol class="org-ol">
<li><a id="orga372924"></a>Comprobación de claves<br />
<div class="outline-text-3" id="text-3-1">
<p>
Primero comprobamos que contamos con clave ssh en el equipo:
</p>

<div class="org-src-container">
<pre class="src src-sh">ls -la ~/.ssh
</pre>
</div>

<p>
Si aparece un listado de claves, podremos saltarnos el siguiente paso. Si no, debemos generar unas claves.
</p>
</div>
</li>

<li><a id="org2cb6776"></a>Generar claves ssh<br />
<div class="outline-text-3" id="text-3-2">
<p>
Necesitas generar una clave ssh el equipo local desde el que te conectas:
</p>

<div class="org-src-container">
<pre class="src src-sh">ssh-keygen -t rsa -b 4096 -C <span style="color: #CC9393;">"correo-electronico@dominio.com"</span>
</pre>
</div>

<p>
Lo cual crea una nueva clave ssh y utiliza el correo electrónico como etiqueta.
</p>

<p>
Si todo va bien, mostrará el mensaje de generación de la clave, pedirá dónde almacenarla y se puede añadir una contraseña:
</p>

<pre class="example">
Generating public/private rsa key pair.
Enter file in which to save the key (/home/usuarix/.ssh/id_rsa): 
Enter passphrase (empty for no passphrase): 
Enter same passphrase again: 
Your identification has been saved in /home/usuarix/.ssh/id_rsa.
Your public key has been saved in /home/usuarix/.ssh/id_rsa.pub.
The key fingerprint is:
(...)
</pre>

<p>
<code>(...)</code> es donde aparece la clave.
</p>

<p>
Ahora que ya tenemos la clave, la pegamos en GitHub en las preferencias, en el apartado "SSH and GPG keys".
</p>
</div>

<ol class="org-ol">
<li><a id="orga453f96"></a>Copia de clave con método <code>pbcopy</code><br />
<div class="outline-text-4" id="text-3-2-1">
<p>
Para seleccionar la clave, podemos emplear el método MacOSX <code>pbcopy</code>, que podemos hackear en GNU/Linux con un <i>alias</i> a partir de <code>xsel</code>:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #DCDCCC; font-weight: bold;">alias</span> <span style="color: #DFAF8F;">pbcopy</span>=<span style="color: #CC9393;">'xsel --clipboard --input'</span>
<span style="color: #DCDCCC; font-weight: bold;">alias</span> <span style="color: #DFAF8F;">pbpaste</span>=<span style="color: #CC9393;">'xsel --clipboard --output'</span>
</pre>
</div>

<p>
De esta forma ya podemos utilizar <code>pbcopy</code>:
</p>

<div class="org-src-container">
<pre class="src src-sh">pbcopy &lt; ~/.ssh/id_rsa.pub
</pre>
</div>

<p>
Y pegamos en GitHub. A partir de ahí ya podremos conectarnos con GitHub de forma segura.
</p>
</div>
</li>

<li><a id="orgd7900fa"></a>Copia de clave con <code>more</code> y copiar y pegar<br />
<div class="outline-text-4" id="text-3-2-2">
<p>
Podemos hacerlo en dos pasos, mostrando la clave y copiándola con el ratón:
</p>

<div class="org-src-container">
<pre class="src src-sh">more ~/.ssh/id_rsa.pub
</pre>
</div>
</div>
</li>
</ol>
</li>

<li><a id="orgd3ff933"></a>Configuración local y comprobación<br />
<div class="outline-text-3" id="text-3-3">
<p>
Ya está casi todo hecho. Ahora falta decirle a git que nos conectamos a GitHub de forma segura. Para ello, podemos comprobar que lo podemos hacer, y en el mismo paso aprobar la conexión:
</p>

<div class="org-src-container">
<pre class="src src-sh">ssh -T git@github.com
</pre>
</div>

<p>
Nos pedirá la contraseña que hayamos puesto a la clave si lo hemos hecho, lo introducimos y listo. Si no, nos saldrá directamente el mensaje:
</p>

<pre class="example">
The authenticity of host 'github.com (192.30.252.1)' can't be established.
RSA key fingerprint is 16:27:ac:a5:76:28:2d:36:63:1b:56:4d:eb:df:a6:48.
Are you sure you want to continue connecting (yes/no)?
</pre>

<p>
Nótese que <code>192.30.252.1</code> es una de las direcciones IP de GitHub, pero podría salir otra. Lo más importante es fijarse en el fingerprint.
</p>

<p>
Le decimos que sí y entonces GitHub nos responde:
</p>

<pre class="example">
Hi usuarix! You've successfully authenticated, but GitHub does not provide shell access.
</pre>

<p>
Donde <code>usuarix</code> es nuestrx usuarix en GitHub. Ya está hecho.
</p>

<p>
Si nos apareciese el mensaje <code>access denied</code>, recomiendo seguir los pasos anteriores o <a href="https://help.github.com/articles/error-permission-denied-publickey">este artículo de GitHub</a> para comprobar que lo hemos hecho bien.
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org4940570" class="outline-2">
<h2 id="org4940570"><span class="section-number-2">4</span> Cambiar el editor por defecto</h2>
<div class="outline-text-2" id="text-4">
<p>
Por defecto, bash y git vienen con el editor <code>vi</code> por defecto. Para cambiarlo, tal como explican en <a href="https://stackoverflow.com/questions/2596805/how-do-i-make-git-use-the-editor-of-my-choice-for-commits">stackoverflow</a>, podemos hacerlo en una o en
ambas.
</p>
</div>
<ol class="org-ol">
<li><a id="orgdcb8043"></a>core.editor<br />
<div class="outline-text-3" id="text-4-1">
<p>
Para usar <code>nano</code> o el editor de texto CLI de nuestra elección, corremos:
</p>
<pre class="example">
git config --global core.editor "nano"
</pre>

<p>
La opción <code>--global</code> es para hacerlo en todo git. Si solo quisiéramos en este repositorio, sería sin esa
opción.
</p>
</div>
</li>
<li><a id="orgad12542"></a>nano como editor por defecto<br />
<div class="outline-text-3" id="text-4-2">
<p>
Lo hacemos en dos líneas, con dos variables de entorno:
</p>

<pre class="example">
export VISUAL=nano
export EDITOR=$VISUAL
</pre>
</div>
</li>
</ol>
</div>
<div id="outline-container-org67d3bca" class="outline-2">
<h2 id="org67d3bca"><span class="section-number-2">5</span> Configuración</h2>
<div class="outline-text-2" id="text-5">
<p>
La primera vez que usas Git te pedirá tu nombre de usuarix y dirección de correo. Lo podemos agregar con el comando <code>config</code>.
</p>

<p>
Tal como comenta <a href="https://stackoverflow.com/a/16682441">sarigalin</a> hay tres niveles de configuración de <code>git</code>, de más específico a más general, siendo
la más específica la que sobreescribe la más general.
</p>

<ul class="org-ul">
<li><code>project</code>, configuración de proyecto, solo disponible para el actual proyecto. Se almacena en <code>.git/config</code>
en el directorio del proyecto.</li>
<li><code>global</code>, configuración global para todos los proyectos del usuario del sistema. Se almacena en <code>~/.gitconfig</code>.</li>
<li><code>system</code>, configuración para el sistema, para todas las cuentas del sistema.</li>
</ul>

<p>
Por tanto, si queremos tener una configuración para el sistema, escribiremos:
</p>

<pre class="example">
git config --system user.name "Fulanito de Tal"
</pre>

<p>
Si queremos que sea global para nuestra cuenta:
</p>

<pre class="example">
git config --global user.name "Fulanito de Tal"
</pre>

<p>
Y si queremos que sea especifica del repositorio, que es la configuración por defecto, no hay que añadir
<code>--project</code> como en los otros dos casos.
</p>

<pre class="example">
git config  user.name "Fulanito de Tal"
</pre>
</div>

<ol class="org-ol">
<li><a id="orgd63e103"></a>Configuración global<br />
<div class="outline-text-3" id="text-5-1">
<p>
Añado el nombre de la cuenta, en este caso el nombre de usuarix en GitHub:
</p>

<div class="org-src-container">
<pre class="src src-sh">git config --global user.name <span style="color: #CC9393;">"Nombre_de_Usuarix"</span>

</pre>
</div>
<p>
Añado la dirección de correo electrónico:
</p>
<div class="org-src-container">
<pre class="src src-sh">git config --global user.email <span style="color: #CC9393;">"usuarix@dominio"</span>
</pre>
</div>

<p>
Si no queremos aplicar esta configuración a todo el sistema y solo a este repositorio porque manejamos más usuarixs de GitHub, por ejemplo, no pongáis la opción <code>--global</code>
</p>

<p>
Cuando hagamos luego <code>git push</code>, nos pedirá el usuario y contraseña por https:
</p>
<pre class="example">
Username for 'https://github.com': usuarix
Password for 'https://usuarix@github.com': 

</pre>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgaa861c5" class="outline-2">
<h2 id="orgaa861c5"><span class="section-number-2">6</span> Crear un repositorio</h2>
<div class="outline-text-2" id="text-6">
</div>
<ol class="org-ol">
<li><a id="org2453abd"></a>Opción GitHub al final<br />
<div class="outline-text-3" id="text-6-1">
<p>
Podemos iniciar el proyecto git en un directorio cualquiera, ya creado, o bien crearlo en uno nuevo.
</p>
</div>

<ol class="org-ol">
