README.org
*** Nuevo repositorio en directorio nuevo

 Si queremos crearlo en uno nuevo, iniciamos el repositorio con la opción =init= seguida del nombre del directorio:

 #+BEGIN_SRC sh
 git init nombre_repo
 #+END_SRC

*** Nuevo repositorio en directorio existente

 También podemos crear un directorio con =mkdir= y luego inicializar ese directorio solo con la opción =init=:

 #+BEGIN_SRC sh
 mkdir nombre_directorio
 cd nombre_directorio
 git init
 #+END_SRC

*** Pasarlo a GitHub

Para que el repositorio o proyecto también esté en GitHub, vamos a Github y creamos un proyecto nuevo que llamamos con el nombre del directorio que hemos creado o del directorio que ya existía.

#+BEGIN_QUOTE
No marques la opción /Initialize with README/ y tampoco le asignes licencia, vamos a crear un repositorio vacío para que nos sea más fácil realizar el primer =push=.

#+END_QUOTE

Conectamos el directorio local donde nos encontramos con GitHub de la siguiente manera:

#+BEGIN_SRC sh
git remote add origin https://github.com/tu_nombre_usuarix/primera-newsapp.git
 #+END_SRC

Donde le decimos a =git= que añadimos un =.git= remoto en la URL de GitHub.

Hemos de crear al menos un archivo README.md donde puedes poner la información del proyecto:

#+BEGIN_SRC sh
echo "# Otro proyecto ni más ni menos" >> README.md
#+END_SRC

Añadimos el archivo a git:

#+BEGIN_SRC sh
git add README.md
#+END_SRC

Lo comiteamos:
#+BEGIN_SRC sh
git commit -m "mi primer commit"
#+END_SRC

Y lo subimos a GitHub:
#+BEGIN_SRC sh
git push -u origin master

#+END_SRC
** Opción GitHub

Primero creas un repositorio con un nombre en Github.

Github te sugiere varias formas de copiarlo en local, en el propio ordenador. Os recomiendo seguir estos pasos:

#+BEGIN_SRC sh
echo "# Proyecto de ..." >> README.md
git init
git add README.md
git commit -m "primer commit"
git remote add origin https://github.com/tu_usuarix/nombre_proyecto.git
git push -u origin master
#+END_SRC

** Comprobaciones

Comprobamos su estado con la opción =status=:

#+BEGIN_SRC sh
git status
#+END_SRC

Si listamos el directorio, comproboremos que tenemos un directorio oculto llamado =.git=

#+BEGIN_SRC sh
ls -la
#+END_SRC

Cuando quieras que el directorio deje de ser un repositorio git, tan solo hay que borrar este directorio oculto con =rm -rf=:

#+BEGIN_SRC sh
rm -rf .git
#+END_SRC

Si en este caso podríamos saber el /status/ de git, el mensaje nos avisaría diciendo que no se trata de un repositorio git.

* Clonar un repositorio

Vamos a cualquier proyecto de GitHub y copiamos la URL que aparece en la casilla de *HTTPS*. En este caso, vamos a clonar el proyecto Boilerplate de Paul Irish:

#+BEGIN_SRC shell
git clone git://github.com/paulirish/html5-boilerplate.git
#+END_SRC

Si en vez de clonar un repositorio lleno queremos hacerlo vacío, hay que poner:

#+BEGIN_SRC shell
git clone --bare https://github.com/exampleuser/old-repository.git

#+END_SRC

* Estado del repositorio

Podemos ver el estado del repositorio con la opción =log=

#+BEGIN_SRC sh
git log
#+END_SRC

Que nos da toda esta información:

- La lista de cada =commit=
- El /hash/ /SHA1/ del /commit/, una cadena única de cada /commit/
- La autoría
- El mensaje que describía el cambio

* Información de cambios en el repositorio

Si queremos ver los cambios en esta versión, debemos utilizar la opción =diff=:

#+BEGIN_SRC sh
git diff
#+END_SRC

* Añadir y modificar documentos
** Añadir

#+BEGIN_SRC sh
git add ruta-nuevos-archivos
git commit -m "comentario sobre cambios"
git push -u origin rama
#+END_SRC

* Renombrar archivos o directorios

*** Renombrar un archivo

#+BEGIN_SRC sh
git mv archivo1 archivo2
git add archivo2
git push -u origin master
#+END_SRC

*** Renombrar un directorio

#+BEGIN_SRC sh
git mv directorio1 directorio2
git add directorio2
git push -u origin master
#+END_SRC

Ver los cambios que vamos a realizar con la opción =-n=, el atajo de =--dry-run=

#+BEGIN_SRC sh
git mv -n nombre_directorio_antiguo nombre_directorio_nuevo
#+END_SRC

*** Case sensitive

Renombrar en sistemas que no distinguen entre mayúsculas y minúsculas, puede dar un error cuando modifiquemos el nombre por caracteres en mayúsculas, por lo que tendríamos que hacer:

#+BEGIN_SRC sh
git mv directorio1 tempname && git mv tempname Directorio2
#+END_SRC

Si nuestro sistema no es /case sensitive/, puede ocurrir que queramos tener dos ficheros que se llaman igual, pero uno emplea mayúsculas y otro minúsculas, y git no nos lo deje incluir.

Por ejemplo, si tenemos =TFM.html= y =tfm.html= en local, y añadimos a git uno de ellos, luego no podremos añadir el otro a no ser que configuremos nuestro git como /case sensitive/:

#+BEGIN_SRC sh
git config core.ignorecase false
#+END_SRC

Ahora ya podremos hacer =git add= con éxito.

La solución viene de [[http://stackoverflow.com/questions/17683458/how-do-i-commit-case-sensitive-only-filename-changes-in-git][Stackoverflow]]



*** Borrar del repositorio

Borrar un archivo del repositorio sin borrarlo del sistema de directorios local:

#+BEGIN_SRC sh
git rm --cached archivo.org

#+END_SRC

*** Borrar un directorio

Para borrar un directorio:
#+BEGIN_SRC sh
git rm --cached -r directorio

#+END_SRC

* Actualizar repositorio

Si queremos actualizar el repositorio con los cambios que se hayan producido en él, lo haremos con la opción =pull=:

#+BEGIN_SRC sh
git pull
#+END_SRC

