index.html
<li><a id="orgf89f4df"></a>Nuevo repositorio en directorio nuevo<br />
<div class="outline-text-4" id="text-6-1-1">
<p>
Si queremos crearlo en uno nuevo, iniciamos el repositorio con la opción <code>init</code> seguida del nombre del directorio:
</p>

<div class="org-src-container">
<pre class="src src-sh"> git init nombre_repo
</pre>
</div>
</div>
</li>

<li><a id="orga52602f"></a>Nuevo repositorio en directorio existente<br />
<div class="outline-text-4" id="text-6-1-2">
<p>
También podemos crear un directorio con <code>mkdir</code> y luego inicializar ese directorio solo con la opción <code>init</code>:
</p>

<div class="org-src-container">
<pre class="src src-sh"> mkdir nombre_directorio
 <span style="color: #DCDCCC; font-weight: bold;">cd</span> nombre_directorio
 git init
</pre>
</div>
</div>
</li>

<li><a id="org8e248ef"></a>Pasarlo a GitHub<br />
<div class="outline-text-4" id="text-6-1-3">
<p>
Para que el repositorio o proyecto también esté en GitHub, vamos a Github y creamos un proyecto nuevo que llamamos con el nombre del directorio que hemos creado o del directorio que ya existía.
</p>

<blockquote>
<p>
No marques la opción <i>Initialize with README</i> y tampoco le asignes licencia, vamos a crear un repositorio vacío para que nos sea más fácil realizar el primer <code>push</code>.
</p>
</blockquote>

<p>
Conectamos el directorio local donde nos encontramos con GitHub de la siguiente manera:
</p>

<div class="org-src-container">
<pre class="src src-sh">git remote add origin https://github.com/tu_nombre_usuarix/primera-newsapp.git
</pre>
</div>

<p>
Donde le decimos a <code>git</code> que añadimos un <code>.git</code> remoto en la URL de GitHub.
</p>

<p>
Hemos de crear al menos un archivo README.md donde puedes poner la información del proyecto:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #DCDCCC; font-weight: bold;">echo</span> <span style="color: #CC9393;">"# Otro proyecto ni m&#225;s ni menos"</span> &gt;&gt; README.md
</pre>
</div>

<p>
Añadimos el archivo a git:
</p>

<div class="org-src-container">
<pre class="src src-sh">git add README.md
</pre>
</div>

<p>
Lo comiteamos:
</p>
<div class="org-src-container">
<pre class="src src-sh">git commit -m <span style="color: #CC9393;">"mi primer commit"</span>
</pre>
</div>

<p>
Y lo subimos a GitHub:
</p>
<div class="org-src-container">
<pre class="src src-sh">git push -u origin master

</pre>
</div>
</div>
</li>
</ol>
</li>
<li><a id="orga0d6860"></a>Opción GitHub<br />
<div class="outline-text-3" id="text-6-2">
<p>
Primero creas un repositorio con un nombre en Github.
</p>

<p>
Github te sugiere varias formas de copiarlo en local, en el propio ordenador. Os recomiendo seguir estos pasos:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #DCDCCC; font-weight: bold;">echo</span> <span style="color: #CC9393;">"# Proyecto de ..."</span> &gt;&gt; README.md
git init
git add README.md
git commit -m <span style="color: #CC9393;">"primer commit"</span>
git remote add origin https://github.com/tu_usuarix/nombre_proyecto.git
git push -u origin master
</pre>
</div>
</div>
</li>

<li><a id="orgf3ff9a6"></a>Comprobaciones<br />
<div class="outline-text-3" id="text-6-3">
<p>
Comprobamos su estado con la opción <code>status</code>:
</p>

<div class="org-src-container">
<pre class="src src-sh">git status
</pre>
</div>

<p>
Si listamos el directorio, comproboremos que tenemos un directorio oculto llamado <code>.git</code>
</p>

<div class="org-src-container">
<pre class="src src-sh">ls -la
</pre>
</div>

<p>
Cuando quieras que el directorio deje de ser un repositorio git, tan solo hay que borrar este directorio oculto con <code>rm -rf</code>:
</p>

<div class="org-src-container">
<pre class="src src-sh">rm -rf .git
</pre>
</div>

<p>
Si en este caso podríamos saber el <i>status</i> de git, el mensaje nos avisaría diciendo que no se trata de un repositorio git.
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-orga860252" class="outline-2">
<h2 id="orga860252"><span class="section-number-2">7</span> Clonar un repositorio</h2>
<div class="outline-text-2" id="text-7">
<p>
Vamos a cualquier proyecto de GitHub y copiamos la URL que aparece en la casilla de <b>HTTPS</b>. En este caso, vamos a clonar el proyecto Boilerplate de Paul Irish:
</p>

<div class="org-src-container">
<pre class="src src-shell">git clone git://github.com/paulirish/html5-boilerplate.git
</pre>
</div>

<p>
Si en vez de clonar un repositorio lleno queremos hacerlo vacío, hay que poner:
</p>

<div class="org-src-container">
<pre class="src src-shell">git clone --bare https://github.com/exampleuser/old-repository.git

</pre>
</div>
</div>
</div>

<div id="outline-container-org470168d" class="outline-2">
<h2 id="org470168d"><span class="section-number-2">8</span> Estado del repositorio</h2>
<div class="outline-text-2" id="text-8">
<p>
Podemos ver el estado del repositorio con la opción <code>log</code>
</p>

<div class="org-src-container">
<pre class="src src-sh">git log
</pre>
</div>

<p>
Que nos da toda esta información:
</p>

<ul class="org-ul">
<li>La lista de cada <code>commit</code></li>
<li>El <i>hash</i> <i>SHA1</i> del <i>commit</i>, una cadena única de cada <i>commit</i></li>
<li>La autoría</li>
<li>El mensaje que describía el cambio</li>
</ul>
</div>
</div>

<div id="outline-container-org1a0d579" class="outline-2">
<h2 id="org1a0d579"><span class="section-number-2">9</span> Información de cambios en el repositorio</h2>
<div class="outline-text-2" id="text-9">
<p>
Si queremos ver los cambios en esta versión, debemos utilizar la opción <code>diff</code>:
</p>

<div class="org-src-container">
<pre class="src src-sh">git diff
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf320467" class="outline-2">
<h2 id="orgf320467"><span class="section-number-2">10</span> Añadir y modificar documentos</h2>
<div class="outline-text-2" id="text-10">
</div>
<ol class="org-ol">
<li><a id="org53c1459"></a>Añadir<br />
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">
<pre class="src src-sh">git add ruta-nuevos-archivos
git commit -m <span style="color: #CC9393;">"comentario sobre cambios"</span>
git push -u origin rama
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org30f665f" class="outline-2">
<h2 id="org30f665f"><span class="section-number-2">11</span> Renombrar archivos o directorios</h2>
<div class="outline-text-2" id="text-11">
</div>
<ol class="org-ol">
<li><a id="orgbed5e88"></a>Renombrar un archivo<br />
<div class="outline-text-4" id="text-11-0-1">
<div class="org-src-container">
<pre class="src src-sh">git mv archivo1 archivo2
git add archivo2
git push -u origin master
</pre>
</div>
</div>
</li>

<li><a id="org3b1c4ba"></a>Renombrar un directorio<br />
<div class="outline-text-4" id="text-11-0-2">
<div class="org-src-container">
<pre class="src src-sh">git mv directorio1 directorio2
git add directorio2
git push -u origin master
</pre>
</div>

<p>
Ver los cambios que vamos a realizar con la opción <code>-n</code>, el atajo de <code>--dry-run</code>
</p>

<div class="org-src-container">
<pre class="src src-sh">git mv -n nombre_directorio_antiguo nombre_directorio_nuevo
</pre>
</div>
</div>
</li>

<li><a id="org90b5b0d"></a>Case sensitive<br />
<div class="outline-text-4" id="text-11-0-3">
<p>
Renombrar en sistemas que no distinguen entre mayúsculas y minúsculas, puede dar un error cuando modifiquemos el nombre por caracteres en mayúsculas, por lo que tendríamos que hacer:
</p>

<div class="org-src-container">
<pre class="src src-sh">git mv directorio1 tempname &amp;&amp; git mv tempname Directorio2
</pre>
</div>

<p>
Si nuestro sistema no es <i>case sensitive</i>, puede ocurrir que queramos tener dos ficheros que se llaman igual, pero uno emplea mayúsculas y otro minúsculas, y git no nos lo deje incluir.
</p>

<p>
Por ejemplo, si tenemos <code>TFM.html</code> y <code>tfm.html</code> en local, y añadimos a git uno de ellos, luego no podremos añadir el otro a no ser que configuremos nuestro git como <i>case sensitive</i>:
</p>

<div class="org-src-container">
<pre class="src src-sh">git config core.ignorecase false
</pre>
</div>

<p>
Ahora ya podremos hacer <code>git add</code> con éxito.
</p>

<p>
La solución viene de <a href="http://stackoverflow.com/questions/17683458/how-do-i-commit-case-sensitive-only-filename-changes-in-git">Stackoverflow</a>
</p>
</div>
</li>



<li><a id="org4046899"></a>Borrar del repositorio<br />
<div class="outline-text-4" id="text-11-0-4">
<p>
Borrar un archivo del repositorio sin borrarlo del sistema de directorios local:
</p>

<div class="org-src-container">
<pre class="src src-sh">git rm --cached archivo.org

</pre>
</div>
</div>
</li>

<li><a id="org89ea0f1"></a>Borrar un directorio<br />
<div class="outline-text-4" id="text-11-0-5">
<p>
Para borrar un directorio:
</p>
<div class="org-src-container">
<pre class="src src-sh">git rm --cached -r directorio

</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org27aeaaa" class="outline-2">
<h2 id="org27aeaaa"><span class="section-number-2">12</span> Actualizar repositorio</h2>
<div class="outline-text-2" id="text-12">
<p>
Si queremos actualizar el repositorio con los cambios que se hayan producido en él, lo haremos con la opción <code>pull</code>:
</p>

<div class="org-src-container">
<pre class="src src-sh">git pull
</pre>
</div>
</div>
</div>
