README.org
* Deshacer cambios

Si realizamos un =commit= pero queremos volver atrás, si no hemos realizado push, es:

#+BEGIN_SRC sh
git reset --hard HEAD-1

#+END_SRC

Si hemos realizado el =commit= lo mejor es hacer [[http://schacon.github.io/git/git-revert.html][revert]]:


#+begin_example
git revert <hash-or-ref>
#+end_example

Para saber el =hash-or-ref= se puede consultar la parte de Commits de la página del repo o
bien con el comando ~git log --pretty=online~.

Luego hacemos ~git push~ para actualizar el repositorio con el cambio revertido.

* Pull request

Haremos un /pull request/ cuando queramos contribuir con nuestros cambios -mejoras, corrección de errores, actualizaciones- a un repositorio que ya existe.

Por eso, lo primero que tenemos que hacer es crear una copia del proyecto:

#+BEGIN_SRC sh
git clone ruta-proyecto.git

#+END_SRC

Luego creamos una rama donde hacer las modificaciones:

#+BEGIN_SRC sh

git checkout -b nueva-rama

#+END_SRC

Al crearla nos movemos a esa rama. Podemos comprobarlo si tenemos el asterisco en la rama deseada:

#+BEGIN_SRC sh
git branch
#+END_SRC

Si no estamos ahí, vamos con:
#+BEGIN_SRC sh 
git checkout nueva-rama
#+END_SRC

Luego hacemos las modificaciones que sean a nuestros archivos, las añadimos, las comiteamos y las subimos a la rama creada:

#+BEGIN_SRC sh
git add ruta-nuevos-archivos
git commit -m "comentario sobre cambios"
git push -u origin nueva-rama
#+END_SRC

Comprobamos el estado de git con =git status=

#+BEGIN_SRC sh
git status
#+END_SRC

Si todo está bien, vamos a nuestra copia del proyecto en Github y en la página del repo pondrá que hay una rama sobre la que hacer un /pull-request/, pinchamos y seguimos los pasos.

Si no hay discusión, si está todo bien, el administrador lo aprobará y entonces podremos borrar la rama. Nos movemos a master y desde ahí borramos en local y en el servidor:

#+BEGIN_SRC sh
git checkout master
git branch -d nueva-rama
git push origin --delete nueva-rama

#+END_SRC
* Borrar rama

En local:

#+BEGIN_SRC sh
git branch -d rama-local

#+END_SRC

Si no se borra así, con =-D=

#+BEGIN_SRC sh
git branch -d rama-local

#+END_SRC

En remoto::

#+BEGIN_SRC sh
git push origin --delete rama-remota

#+END_SRC

o también:
#+BEGIN_SRC sh
git push origin :ramaremota

#+END_SRC

* Mantener un repositorio forkeado actualizado

Añades =remoteando= como servidor remoto:

#+BEGIN_SRC sh
git remote add remoteando git://ruta-repositorio.git
#+END_SRC

Actualizas remoteando pero sin integrar los cambios
#+BEGIN_SRC sh
git fetch upstream
#+END_SRC

Integras los cambios con la versión local:

#+BEGIN_SRC sh
git pull upstream master

#+END_SRC

* Publicación web

Si el contenido del proyecto es HTML, podemos utilizar a GitHub como servidor web de nuestro contenido web, a través de la funcionalidad [[http://pages.github.com/][Pages]].

Se puede hacer de dos maneras:

** Nombre del repositorio

Si el nombre del repositorio sigue la estructura "nombre-de-usuarix.github.io", el proyecto que cuelgue de ahí se publicará automágicamente en http://nombre-de-usuarix.github.io

** Rama gh-pages

Cualquier repositorio que tenga la rama =gh-pages= será publicado, y se verá su contenido web.

Por ejemplo, si tenemos un repositorio con nombre =mi-proyecto= que contiene una web y queremos publicarlo como página web, solo tenemos que crear una nueva rama =branch= de nuestro proyecto que llamaremos =gh-pages=:

#+BEGIN_SRC sh
git checkout -b gh-pages
#+END_SRC

Luego ponemos ahí todo el contenido de la rama =master=:

#+BEGIN_SRC sh
git merge master
#+END_SRC

Por último subimos a GitHub todo lo que tenemos en la nueva rama:

#+BEGIN_SRC sh
$ git push -u origin gh-pages

#+END_SRC

En unos minutos, GitHub lo habrá publicado en una URL del tipo http://nombre-de-usuarix.github.io/mi-proyecto

Si tu repositorio es solo una web, puedes optar por utilizar solo la rama =gh-pages= en vez de mantener las dos ramas. Para ello tienes que elegir en GitHub qué rama utilizas.

Si mantienes las dos, actualizar la web se puede convertir en algo tedioso si lo haces habitualmente.

Para facilitar la tarea, [[http://brettterpstra.com/2012/09/26/github-tip-easily-sync-your-master-to-github-pages/][brettterpstra.com recomienda una solución]], puedes editar =.git/config= y añadir estas líneas a =[remote "origin"]=:

#+BEGIN_SRC sh
push = +refs/heads/master:refs/heads/gh-pages
push = +refs/heads/master:refs/heads/master
#+END_SRC

Quedando así:

#+BEGIN_SRC sh
[remote "origin"]
	fetch = +refs/heads/*:refs/remotes/origin/*
	url = git@github.com:user/repo.git
	push = +refs/heads/master:refs/heads/gh-pages
	push = +refs/heads/master:refs/heads/master

#+END_SRC

De esta manera, cuando hagas git push lo harás en los dos repos.

* Gitignore
https://git-scm.com/docs/gitignore
* Problemas
** 403 fatal: HTTP request failed
 http://stackoverflow.com/questions/7438313/pushing-to-git-returning-error-code-403-fatal-http-request-failed
 #+BEGIN_SRC sh
 git remote set-url origin https://yourusername@github.com/user/repo.git

 #+END_SRC

** git: error: src refspec master does not match any
http://stackoverflow.com/questions/10568641/git-error-src-refspec-master-does-not-match-any
#+BEGIN_SRC sh
git remote rm origin
git remote set-url origin git@....
git push -u origin master
#+END_SRC

** Please, commit your changes or stash them before you can merge.
Si alguien o tú mismo en otro equipo ha actualizado el repositorio
mientras tú trabajabas y te sale este error, sin entrar en las
opciones con las ramas, tienes [[http://stackoverflow.com/questions/15745045/how-do-i-resolve-git-saying-commit-your-changes-or-stash-them-before-you-can-me][tres opciones]]:

*** Comitear el cambio de la forma típica:
#+BEGIN_SRC sh
git commit -m "comentario"
#+END_SRC

