index.html

<div id="outline-container-org2b7dd1c" class="outline-2">
<h2 id="org2b7dd1c"><span class="section-number-2">13</span> Deshacer cambios</h2>
<div class="outline-text-2" id="text-13">
<p>
Si realizamos un <code>commit</code> pero queremos volver atrás, si no hemos realizado push, es:
</p>

<div class="org-src-container">
<pre class="src src-sh">git reset --hard HEAD-1

</pre>
</div>

<p>
Si hemos realizado el <code>commit</code> lo mejor es hacer <a href="http://schacon.github.io/git/git-revert.html">revert</a>:
</p>


<pre class="example">
git revert &lt;hash-or-ref&gt;
</pre>

<p>
Para saber el <code>hash-or-ref</code> se puede consultar la parte de Commits de la página del repo o
bien con el comando <code>git log --pretty=online</code>.
</p>

<p>
Luego hacemos <code>git push</code> para actualizar el repositorio con el cambio revertido.
</p>
</div>
</div>

<div id="outline-container-org44859bc" class="outline-2">
<h2 id="org44859bc"><span class="section-number-2">14</span> Pull request</h2>
<div class="outline-text-2" id="text-14">
<p>
Haremos un <i>pull request</i> cuando queramos contribuir con nuestros cambios -mejoras, corrección de errores, actualizaciones- a un repositorio que ya existe.
</p>

<p>
Por eso, lo primero que tenemos que hacer es crear una copia del proyecto:
</p>

<div class="org-src-container">
<pre class="src src-sh">git clone ruta-proyecto.git

</pre>
</div>

<p>
Luego creamos una rama donde hacer las modificaciones:
</p>

<div class="org-src-container">
<pre class="src src-sh">
git checkout -b nueva-rama

</pre>
</div>

<p>
Al crearla nos movemos a esa rama. Podemos comprobarlo si tenemos el asterisco en la rama deseada:
</p>

<div class="org-src-container">
<pre class="src src-sh">git branch
</pre>
</div>

<p>
Si no estamos ahí, vamos con:
</p>
<div class="org-src-container">
<pre class="src src-sh">git checkout nueva-rama
</pre>
</div>

<p>
Luego hacemos las modificaciones que sean a nuestros archivos, las añadimos, las comiteamos y las subimos a la rama creada:
</p>

<div class="org-src-container">
<pre class="src src-sh">git add ruta-nuevos-archivos
git commit -m <span style="color: #CC9393;">"comentario sobre cambios"</span>
git push -u origin nueva-rama
</pre>
</div>

<p>
Comprobamos el estado de git con <code>git status</code>
</p>

<div class="org-src-container">
<pre class="src src-sh">git status
</pre>
</div>

<p>
Si todo está bien, vamos a nuestra copia del proyecto en Github y en la página del repo pondrá que hay una rama sobre la que hacer un <i>pull-request</i>, pinchamos y seguimos los pasos.
</p>

<p>
Si no hay discusión, si está todo bien, el administrador lo aprobará y entonces podremos borrar la rama. Nos movemos a master y desde ahí borramos en local y en el servidor:
</p>

<div class="org-src-container">
<pre class="src src-sh">git checkout master
git branch -d nueva-rama
git push origin --delete nueva-rama

</pre>
</div>
</div>
</div>
<div id="outline-container-org9f01ce3" class="outline-2">
<h2 id="org9f01ce3"><span class="section-number-2">15</span> Borrar rama</h2>
<div class="outline-text-2" id="text-15">
<p>
En local:
</p>

<div class="org-src-container">
<pre class="src src-sh">git branch -d rama-local

</pre>
</div>

<p>
Si no se borra así, con <code>-D</code>
</p>

<div class="org-src-container">
<pre class="src src-sh">git branch -d rama-local

</pre>
</div>

<p>
En remoto::
</p>

<div class="org-src-container">
<pre class="src src-sh">git push origin --delete rama-remota

</pre>
</div>

<p>
o también:
</p>
<div class="org-src-container">
<pre class="src src-sh">git push origin :ramaremota

</pre>
</div>
</div>
</div>

<div id="outline-container-orgd9ed393" class="outline-2">
<h2 id="orgd9ed393"><span class="section-number-2">16</span> Mantener un repositorio forkeado actualizado</h2>
<div class="outline-text-2" id="text-16">
<p>
Añades <code>remoteando</code> como servidor remoto:
</p>

<div class="org-src-container">
<pre class="src src-sh">git remote add remoteando git://ruta-repositorio.git
</pre>
</div>

<p>
Actualizas remoteando pero sin integrar los cambios
</p>
<div class="org-src-container">
<pre class="src src-sh">git fetch upstream
</pre>
</div>

<p>
Integras los cambios con la versión local:
</p>

<div class="org-src-container">
<pre class="src src-sh">git pull upstream master

</pre>
</div>
</div>
</div>

<div id="outline-container-org1a53552" class="outline-2">
<h2 id="org1a53552"><span class="section-number-2">17</span> Publicación web</h2>
<div class="outline-text-2" id="text-17">
<p>
Si el contenido del proyecto es HTML, podemos utilizar a GitHub como servidor web de nuestro contenido web, a través de la funcionalidad <a href="http://pages.github.com/">Pages</a>.
</p>

<p>
Se puede hacer de dos maneras:
</p>
</div>

<ol class="org-ol">
<li><a id="org134a28d"></a>Nombre del repositorio<br />
<div class="outline-text-3" id="text-17-1">
<p>
Si el nombre del repositorio sigue la estructura "nombre-de-usuarix.github.io", el proyecto que cuelgue de ahí se publicará automágicamente en <a href="http://nombre-de-usuarix.github.io">http://nombre-de-usuarix.github.io</a>
</p>
</div>
</li>

<li><a id="org8d407eb"></a>Rama gh-pages<br />
<div class="outline-text-3" id="text-17-2">
<p>
Cualquier repositorio que tenga la rama <code>gh-pages</code> será publicado, y se verá su contenido web.
</p>

<p>
Por ejemplo, si tenemos un repositorio con nombre <code>mi-proyecto</code> que contiene una web y queremos publicarlo como página web, solo tenemos que crear una nueva rama <code>branch</code> de nuestro proyecto que llamaremos <code>gh-pages</code>:
</p>

<div class="org-src-container">
<pre class="src src-sh">git checkout -b gh-pages
</pre>
</div>

<p>
Luego ponemos ahí todo el contenido de la rama <code>master</code>:
</p>

<div class="org-src-container">
<pre class="src src-sh">git merge master
</pre>
</div>

<p>
Por último subimos a GitHub todo lo que tenemos en la nueva rama:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ git push -u origin gh-pages

</pre>
</div>

<p>
En unos minutos, GitHub lo habrá publicado en una URL del tipo <a href="http://nombre-de-usuarix.github.io/mi-proyecto">http://nombre-de-usuarix.github.io/mi-proyecto</a>
</p>

<p>
Si tu repositorio es solo una web, puedes optar por utilizar solo la rama <code>gh-pages</code> en vez de mantener las dos ramas. Para ello tienes que elegir en GitHub qué rama utilizas.
</p>

<p>
Si mantienes las dos, actualizar la web se puede convertir en algo tedioso si lo haces habitualmente.
</p>

<p>
Para facilitar la tarea, <a href="http://brettterpstra.com/2012/09/26/github-tip-easily-sync-your-master-to-github-pages/">brettterpstra.com recomienda una solución</a>, puedes editar <code>.git/config</code> y añadir estas líneas a <code>[remote "origin"]</code>:
</p>

<div class="org-src-container">
<pre class="src src-sh">push = +refs/heads/master:refs/heads/gh-pages
push = +refs/heads/master:refs/heads/master
</pre>
</div>

<p>
Quedando así:
</p>

<div class="org-src-container">
<pre class="src src-sh">[remote <span style="color: #CC9393;">"origin"</span>]
        fetch = +refs/heads/*:refs/remotes/origin/*
        url = git@github.com:user/repo.git
        push = +refs/heads/master:refs/heads/gh-pages
        push = +refs/heads/master:refs/heads/master

</pre>
</div>

<p>
De esta manera, cuando hagas git push lo harás en los dos repos.
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgac9b7f6" class="outline-2">
<h2 id="orgac9b7f6"><span class="section-number-2">18</span> Gitignore</h2>
<div class="outline-text-2" id="text-18">
<p>
<a href="https://git-scm.com/docs/gitignore">https://git-scm.com/docs/gitignore</a>
</p>
</div>
</div>
<div id="outline-container-org9549190" class="outline-2">
<h2 id="org9549190"><span class="section-number-2">19</span> Problemas</h2>
<div class="outline-text-2" id="text-19">
</div>
<ol class="org-ol">
<li><a id="org90dff96"></a>403 fatal: HTTP request failed<br />
<div class="outline-text-3" id="text-19-1">
<p>
<a href="http://stackoverflow.com/questions/7438313/pushing-to-git-returning-error-code-403-fatal-http-request-failed">http://stackoverflow.com/questions/7438313/pushing-to-git-returning-error-code-403-fatal-http-request-failed</a>
</p>
<div class="org-src-container">
<pre class="src src-sh"> git remote set-url origin https://yourusername@github.com/user/repo.git

</pre>
</div>
</div>
</li>

<li><a id="orgf64e3b8"></a>git: error: src refspec master does not match any<br />
<div class="outline-text-3" id="text-19-2">
<p>
<a href="http://stackoverflow.com/questions/10568641/git-error-src-refspec-master-does-not-match-any">http://stackoverflow.com/questions/10568641/git-error-src-refspec-master-does-not-match-any</a>
</p>
<div class="org-src-container">
<pre class="src src-sh">git remote rm origin
git remote set-url origin git@....
git push -u origin master
</pre>
</div>
</div>
</li>

<li><a id="org780f7c8"></a>Please, commit your changes or stash them before you can merge.<br />
<div class="outline-text-3" id="text-19-3">
<p>
Si alguien o tú mismo en otro equipo ha actualizado el repositorio
mientras tú trabajabas y te sale este error, sin entrar en las
opciones con las ramas, tienes <a href="http://stackoverflow.com/questions/15745045/how-do-i-resolve-git-saying-commit-your-changes-or-stash-them-before-you-can-me">tres opciones</a>:
</p>
</div>

<ol class="org-ol">
<li><a id="org1999b06"></a>Comitear el cambio de la forma típica:<br />
<div class="outline-text-4" id="text-19-3-1">
<div class="org-src-container">
<pre class="src src-sh">git commit -m <span style="color: #CC9393;">"comentario"</span>
</pre>
</div>
</div>
</li>
