README.org
*** Reservarlo o depositarlo en una pila o /stack/ con =stash=:

#+BEGIN_SRC sh
git stash

#+END_SRC

Ahí puedes hacer =push= y aparece en orden inverso:

#+BEGIN_SRC sh
git stash pop
#+END_SRC

*** Descartar los cambios que has hecho

#+BEGIN_SRC sh
git reset --hard

#+END_SRC

** Github fatal remote origin already exists

Versión corta de la solución: actualiza irotisoper le:otomer o


TL;DR you should just update the existing remote:

$ git remote set-url origin git@github.com:ppreyer/first_app.git

Long version:

As the error message indicates, there is already a remote configured with the same name. So you can either add the new remote with a different name or update the existing one if you don't need it:

To add a new remote, called for example github instead of origin (which obviously already exists in your system), do the following:

$ git remote add github git@github.com:ppreyer/first_app.git

Remember though, everywhere in the tutorial you see "origin" you should replace it with "github". For example $ git push origin master should now be $ git push github master.

However, if you want to see what that origin which already exists is, you can do a $ git remote -v. If you think this is there by some error, you can update it like so:

$ git remote set-url origin git@github.com:ppreyer/first_app.git

http://stackoverflow.com/questions/10904339/github-fatal-remote-origin-already-exists
* Pruebas
[[https://try.github.io/levels/1/challenges/1][Try Git]]
* Bibliografía
** Algunos recursos
- [[https://git-scm.com/book/es][Git, distributed is the new centralized]]
- http://alistapart.com/article/get-started-with-git
- http://progit.org/book/ch1-4.html
- [[http://ferblape.github.io/github.com-medialab-desigualdad][Qué es y cómo publicar nuestros proyectos en Github]]
- [[http://rooteando.com/escenarios-de-trabajo-en-git/][Escenario de trabajo en git]]
** Cheatsheets
- [[http://overapi.com/static/cs/git-cheat-sheet.pdf][git cheat sheet]]
