index.html

<li><a id="orgc940ac9"></a>Reservarlo o depositarlo en una pila o <i>stack</i> con <code>stash</code>:<br />
<div class="outline-text-4" id="text-19-3-2">
<div class="org-src-container">
<pre class="src src-sh">git stash

</pre>
</div>

<p>
Ahí puedes hacer <code>push</code> y aparece en orden inverso:
</p>

<div class="org-src-container">
<pre class="src src-sh">git stash pop
</pre>
</div>
</div>
</li>

<li><a id="orgb8fdf7a"></a>Descartar los cambios que has hecho<br />
<div class="outline-text-4" id="text-19-3-3">
<div class="org-src-container">
<pre class="src src-sh">git reset --hard

</pre>
</div>
</div>
</li>
</ol>
</li>

<li><a id="orga7cdf01"></a>Github fatal remote origin already exists<br />
<div class="outline-text-3" id="text-19-4">
<p>
Versión corta de la solución: actualiza irotisoper le:otomer o
</p>


<p>
TL;DR you should just update the existing remote:
</p>

<p>
$ git remote set-url origin git@github.com:ppreyer/first_app.git
</p>

<p>
Long version:
</p>

<p>
As the error message indicates, there is already a remote configured with the same name. So you can either add the new remote with a different name or update the existing one if you don't need it:
</p>

<p>
To add a new remote, called for example github instead of origin (which obviously already exists in your system), do the following:
</p>

<p>
$ git remote add github git@github.com:ppreyer/first_app.git
</p>

<p>
Remember though, everywhere in the tutorial you see "origin" you should replace it with "github". For example $ git push origin master should now be $ git push github master.
</p>

<p>
However, if you want to see what that origin which already exists is, you can do a $ git remote -v. If you think this is there by some error, you can update it like so:
</p>

<p>
$ git remote set-url origin git@github.com:ppreyer/first_app.git
</p>

<p>
<a href="http://stackoverflow.com/questions/10904339/github-fatal-remote-origin-already-exists">http://stackoverflow.com/questions/10904339/github-fatal-remote-origin-already-exists</a>
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-orga9bc21a" class="outline-2">
<h2 id="orga9bc21a"><span class="section-number-2">20</span> Pruebas</h2>
<div class="outline-text-2" id="text-20">
<p>
<a href="https://try.github.io/levels/1/challenges/1">Try Git</a>
</p>
</div>
</div>
<div id="outline-container-org57f0eb9" class="outline-2">
<h2 id="org57f0eb9"><span class="section-number-2">21</span> Bibliografía</h2>
<div class="outline-text-2" id="text-21">
</div>
<ol class="org-ol">
<li><a id="orgea8dfb4"></a>Algunos recursos<br />
<div class="outline-text-3" id="text-21-1">
<ul class="org-ul">
<li><a href="https://git-scm.com/book/es">Git, distributed is the new centralized</a></li>
<li><a href="http://alistapart.com/article/get-started-with-git">http://alistapart.com/article/get-started-with-git</a></li>
<li><a href="http://progit.org/book/ch1-4.html">http://progit.org/book/ch1-4.html</a></li>
<li><a href="http://ferblape.github.io/github.com-medialab-desigualdad">Qué es y cómo publicar nuestros proyectos en Github</a></li>
<li><a href="http://rooteando.com/escenarios-de-trabajo-en-git/">Escenario de trabajo en git</a></li>
</ul>
</div>
</li>
<li><a id="org8ea1b6a"></a>Cheatsheets<br />
<div class="outline-text-3" id="text-21-2">
<ul class="org-ul">
<li><a href="http://overapi.com/static/cs/git-cheat-sheet.pdf">git cheat sheet</a></li>
</ul>
</div>
</li>
</ol>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
